app/views/proposals/show.html.erb


		<% @proposal.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."proposal_id" = $1  [["proposal_id", 10]]