app/controllers/comments_controller.rb

SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def create
    @comment = Comment.create(comment_params)
    @proposal = Proposal.find(params[:proposal_id])