app/controllers/proposals_controller.rb

  def show
    @proposal = Proposal.find(params[:id])
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @proposal = Proposal.find(params[:id])
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @proposal = Proposal.new(proposal_params)

    if @proposal.save
---
INSERT INTO "proposals" ("title", "abstract", "intro", "hypothesis", "method", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "asdfasd"], ["abstract", "asdfasd"], ["intro", "asdfasd"], ["hypothesis", "asdfas"], ["method", "asdfa"], ["created_at", 2016-08-25 19:31:29 UTC], ["updated_at", 2016-08-25 19:31:29 UTC]]