app/controllers/users_controller.rb

	def show
		@user = User.find(current_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]

	def create
		if params[:user][:password] != params[:user][:password_confirmation]
			@errors = ["ERROR: Passwords Don't Match!"]
			redirect_to '/'
		else
			user = User.new(user_params)
			if user.save
---
INSERT INTO "users" ("name", "email", "password_hash", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"